Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket_policy.public-read has changed
~ resource "aws_s3_bucket_policy" "public-read" {
        id     = "terraform-20220123171338585400000002"
      ~ policy = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = [
                            "s3:GetObjectVersion",
                            "s3:GetObject",
                        ]
                        Effect    = "Allow"
                        Principal = "*"
                        Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                        Sid       = ""
                    },
                    {
                        Action    = "s3:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                        Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3-home-ipd will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3-home-ipd"  {
      ~ id      = "2772242395" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                      - Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::terraform-20220123171338585400000002/*",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::terraform-20220123171338585400000002/*",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_s3_bucket.s3-home must be replaced
-/+ resource "aws_s3_bucket" "s3-home" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::terraform-20220123171338585400000002" -> (known after apply)
      ~ bucket                      = "terraform-20220123171338585400000002" -> (known after apply)
      ~ bucket_domain_name          = "terraform-20220123171338585400000002.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = "foodtrucks" # forces replacement
      ~ bucket_regional_domain_name = "terraform-20220123171338585400000002.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "terraform-20220123171338585400000002" -> (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ website_domain              = "s3-website.us-east-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "terraform-20220123171338585400000002.s3-website.us-east-2.amazonaws.com" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      ~ website {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_s3_bucket_policy.public-read must be replaced
-/+ resource "aws_s3_bucket_policy" "public-read" {
      ~ bucket = "terraform-20220123171338585400000002" -> (known after apply) # forces replacement
      ~ id     = "terraform-20220123171338585400000002" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                      - Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # github_actions_secret.S3_BUCKET must be replaced
-/+ resource "github_actions_secret" "S3_BUCKET" {
      ~ created_at      = "2022-01-23 17:19:23 +0000 UTC" -> (known after apply)
      ~ id              = "foodtrucks:S3_BUCKET" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-01-23 17:19:23 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
